## Задача: 
*Написать программу, которая из имеющегося массива строк формирует
новый массив из строк, длина которых меньше, либо равна 3 символам.
Первоначальный массив можно ввести с клавиатуры, либо задать на старте выполнения алгоритма.
При решении не рекомендуется пользоваться коллекциями, лучше обойтись исключительно массивами.*

### Решение задачи
1. В первую очередь объявим переменную именем "array" , зададим ей строковый тип "string" и обозначим квадратными скобками "[ ]", что в ней будет храниться массив. Далее вносим элементы , которые будут храниться в переменной. 
```
string [] array =  {"Встреча","4ercv","345gred","fdg","45"};
```
2. Следующим шагом формируем цикл "for" в нём объявляем счетчик "i" c целочисленным типом "int" и с изначальным значением равным нулю. Условие цикла, до тех пор пока "i" меньше количества элементов  в массиве, то увеличеваем "i" на еденицу. 

```
for(int i = 0;i < array.Length;i++)
```

3. В теле цикла создаем условие "if" если элементы состоящие из трех и менее символов , то этоти элементы выводим на экран в консоле

```
{
    if(array[i].Length <= 3 )
    Console.WriteLine($" Значения меньше или равный 3-{array[i]}" );
}
```